{
  "basic_info": {
    "description_header": "Hi",
    "description": "👋 I'm Ahmed, a Full-Stack Engineer with 8 years of experience in designing and developing complex, high-performance web applications. I've proven myself working on distributed systems across diverse domains such as healthcare, human resources, IoT, queue management, and social networks. I master service-oriented architectures, CI/CD pipelines, cloud scalability, and the implementation of secure data flows. Throughout my career, I've worked with cutting-edge technologies and methodologies, always following best practices 🤓 and applying clean code principles. I'm committed to finding elegant solutions to challenging problems and producing high-quality, scalable work 📈. Currently leading a team as a Full-Stack Lead, I'm always eager to take on new challenges and expand my knowledge. Thank you for choosing me 💜",
    "section_name": {
      "about": "About me",
      "projects": "Projects",
      "skills": "Skills",
      "experience": "Experience",
      "contact": "Contact"
    },
    "role": "Role"
  },
  "projects": [
    {
      "title": "DELTI",
      "startDate": "2017",
      "description": "A comprehensive queue management and appointment booking system designed for multiple industrial sectors. The platform enables businesses to efficiently manage customer queues, schedule appointments, and streamline service operations. It includes both client and provider interfaces, with mobile applications for enhanced accessibility.",
      "role": "I worked within a technical team of 5 people on developing this queue management and appointment booking system. I gathered functional requirements for both client and provider interfaces and wrote technical specifications. I developed the provider web application using Angular (v4-5), implementing smooth navigation with RxJS and efficient state management. I created back-end services with Java and Spring Boot, ensuring scalability and maintainability. I created and executed unit tests with JUnit, Mockito, and AssertJ, following Behavior-Driven Development (BDD) methodology. I managed version control with Git, containerized services using Docker, and deployed on virtual machines. I worked on mobile application features with Flutter and Dart, using GetX for state management. I implemented cloud-based services on Google Cloud, including Firestore, Cloud Functions, push notifications, dynamic links, Cloud Storage, authentication, and hosting. I configured CI/CD workflows with GitHub Actions and integrated Algolia for advanced search features.",
      "images": [
        "images/portfolio/delti/p1.jpg",
        "images/portfolio/delti/p2.jpg",  
        "images/portfolio/delti/p3.jpg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular 4-5"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-java-plain",
          "name": "Java"
        },
        {
          "class": "devicon-spring-plain",
          "name": "Spring Boot"
        },
        {
          "class": "devicon-flutter-plain",
          "name": "Flutter"
        },
        {
          "class": "devicon-nodejs-plain",
          "name": "Node.js"
        },
        {
          "class": "devicon-googlecloud-plain",
          "name": "Google Cloud"
        },
        {
          "class": "devicon-docker-plain",
          "name": "Docker"
        },
        {
          "uri": "algolia-svgrepo-com.svg",
          "name": "Algolia",
          "type": "svg"
        }
      ]
    },
    {
      "title": "ViaLeads",
      "startDate": "2018",
      "description": "ViaLeads is a 100% cloud-based solution that combines multiple predictive dialers and a scripting tool designed for call centers. It automates your inbound and outbound call campaigns, provides real-time production monitoring, and offers customizable supervision screens. ViaLeads is equipped with powerful call engines, including preview, progressive, predictive, and click-to-call. It also offers on-demand, scheduled, or random recording, campaign reports, and detailed statistics by agent, group, service, hour, day, and month.",
      "role": "I began my journey at ViaLeads as a Full Stack developer, but my skills and expertise led me to become the Front-End lead for the project. One of the major challenges I faced while working on ViaLeads was integrating new features on top of an existing database. Another challenge was developing the Auto Mode feature that distributes tasks to agents based on various factors such as scheduling, priority, and recall. Lastly, creating dynamic scripts and forms that adapt to the client's phone call responses was also a complex task that I overcame through my strong problem-solving skills.",
      "images": [
        "images/portfolio/vialeads/p0.png",
        "images/portfolio/vialeads/p1.png",
        "images/portfolio/vialeads/p2.png",
        "images/portfolio/vialeads/p3.png"
      ],
      "url": "https://viadialog.com/en/vialeads/",
      "technologies": [
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-java-plain",
          "name": "JAVA"
        },
        {
          "class": "devicon-spring-plain",
          "name": "Spring"
        },
        {
          "uri": "jhipster-icon-svgrepo-com.svg",
          "name": "JHipster",
          "type": "svg"
        },
        {
          "class": "devicon-mysql-plain",
          "name": "Mysql"
        },
        {
          "class": "devicon-mongodb-plain",
          "name": "Mongodb"
        },
        {
          "uri": "elasticsearch-svgrepo-com.svg",
          "name": "Elasticsearch",
          "type": "svg"
        },
        {
          "uri": "rabbitmq-svgrepo-com.svg",
          "name": "RabbitMQ",
          "type": "svg"
        }
      ]
    },
    {
      "title": "Angage",
      "startDate": "2019",
      "description": "Angage is a mobile engagement and interactive platform that allows organizations to engage their audience during meetings, training sessions, and lectures. It offers features such as voting, polling, quizzes, ratings, brainstorming, and more. It also includes interaction tools such as networking, 1-to-1 meetings, private and group chat, and moderation.",
      "role": "During my time with Tech-Instinct, I worked as a full-stack developer on the Angage mobile engagement and interactive platform. As the project progressed, I transitioned to a fully front-end role. The team faced a number of challenges, such as implementing the brainstorming feature, integrating Zoom for live streaming within the app, and incorporating Stripe for payments - which was my first time using it. However, with the collective effort of our team and extensive research, we were able to overcome these challenges and deliver a successful project.",
      "images": [
        "images/portfolio/angage/p0.png",
        "images/portfolio/angage/p1.png",
        "images/portfolio/angage/p2.png",
        "images/portfolio/angage/p3.png",
        "images/portfolio/angage/p4.png",
        "images/portfolio/angage/p5.png",
        "images/portfolio/angage/p6.png",
        "images/portfolio/angage/p7.png"
      ],
      "url": "https://angage.live/",
      "technologies": [
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-java-plain",
          "name": "JAVA"
        },
        {
          "class": "devicon-spring-plain",
          "name": "Spring"
        },
        {
          "uri": "jhipster-icon-svgrepo-com.svg",
          "name": "JHipster",
          "type": "svg"
        },
        {
          "class": "devicon-mongodb-plain",
          "name": "Mongodb"
        },
        {
          "uri": "stripe-s-svgrepo-com.svg",
          "name": "Stripe",
          "type": "svg"
        },
        {
          "uri": "rabbitmq-svgrepo-com.svg",
          "name": "RabbitMQ",
          "type": "svg"
        }
      ]
    },
    {
      "title": "RH Partner",
      "startDate": "2020",
      "description": "RH Partner is a comprehensive web application for managing human resources, offering 10 modules that cover essential HR functions. It includes features such as creating and tracking company records, managing employee time and attendance, and payroll management. RH Partner also offers a collaborative SaaS solution with an employee portal for simplified communication between managers and employees. The employee portal is available for free on desktop and mobile devices and provides a range of features for managing employee requests and documentation. RH Partner's SIRH helps organizations streamline and optimize their HR processes with an intuitive dashboard for tracking performance indicators.",
      "role": "As the front-end lead in RH Partner, I was responsible for setting up the project, defining the front-end architecture, selecting appropriate libraries, and overseeing code reviews. I also solved complex problems and ensured the successful execution of the project.",
      "images": [
        "images/portfolio/rh-partner/p0.png",
        "images/portfolio/rh-partner/p1.png",
        "images/portfolio/rh-partner/p2.png",
        "images/portfolio/rh-partner/p3.png"
      ],
      "url": "https://rh-partner.com/",
      "technologies": [
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-java-plain",
          "name": "JAVA"
        },
        {
          "class": "devicon-spring-plain",
          "name": "Spring"
        },
        {
          "uri": "jhipster-icon-svgrepo-com.svg",
          "name": "JHipster",
          "type": "svg"
        },
        {
          "class": "devicon-postgresql-plain",
          "name": "PostgreSQL"
        },
        {
          "uri": "elasticsearch-svgrepo-com.svg",
          "name": "Elasticsearch",
          "type": "svg"
        },
        {
          "uri": "rabbitmq-svgrepo-com.svg",
          "name": "RabbitMQ",
          "type": "svg"
        }
      ]
    },
    {
      "title": "SP Tools",
      "startDate": "2020",
      "description": "SP Tools is a mobile app that serves as the shop portal for the company, offering a comprehensive range of features to enhance the user experience. Developed by our team, the app includes various tools, power tools, hand tools, auto specialty tools, and garage equipment. It also features promotions and SP credits to reward loyal customers. The app is designed to be user-friendly and intuitive, allowing users to easily browse and purchase products directly from their mobile devices.",
      "role": "As the Scrum Master and Backend Developer at SP Tools, I played a pivotal role in the development of the v2 mobile application. My responsibilities included overseeing the agile development process, ensuring timely delivery of features and resolving complex technical challenges. Alongside my team, I successfully implemented key features such as promotions and SP credits, delivering a seamless user experience. Overall, my contribution ensured the successful completion of the project and its alignment with the company's strategic goals.",
      "images": [
        "images/portfolio/sptools/p0.jpg",
        "images/portfolio/sptools/p1.jpg",
        "images/portfolio/sptools/p2.jpg"
      ],
      "url": "https://play.google.com/store/search?q=sp%20tools&c=apps",
      "technologies": [
        {
          "class": "devicon-react-original",
          "name": "React Native"
        },
        {
          "class": "devicon-nodejs-plain",
          "name": "NodeJS"
        },
        {
          "class": "devicon-express-original",
          "name": "ExpressJS"
        },
        {
          "class": "devicon-mongodb-plain",
          "name": "Mongodb"
        }
      ]
    },
    {
      "title": "GravityBI",
      "startDate": "2021",
      "description": "GravityBi is a comprehensive cloud-based platform that provides an efficient and effective solution for human resource management and financial management for remote work. Developed by KeenEye, a startup aimed at improving workplace efficiency, GravityBi boasts an array of modules that include finance, leave, attendance, employee, loan, onboarding, and payment. Its user-friendly interface and advanced features enable remote teams to efficiently manage their HR and financial processes, saving valuable time and resources.",
      "role": "As a Scrum Master and Back-End Developer in GravityBi, I played a crucial role in the development and release of GravityBI. I took full ownership of the Payroll and Attendance modules and provided valuable inputs for other modules such as Employee, Leave, and Payment. With my expertise in Agile project management and software development, I ensured the timely delivery of high-quality software solutions to meet the needs of our clients.",
      "images": [
        "images/portfolio/gravity/p0.png",
        "images/portfolio/gravity/p1.png",
        "images/portfolio/gravity/p2.png"
      ],
      "url": "https://gravitybi.com/",
      "technologies": [
        {
          "class": "devicon-vuejs-plain",
          "name": "VueJS"
        },
        {
          "class": "devicon-nodejs-plain",
          "name": "NodeJS"
        },
        {
          "class": "devicon-express-original",
          "name": "ExpressJS"
        },
        {
          "uri": "nestjs-svgrepo-com.svg",
          "name": "NestJS",
          "type": "svg"
        },
        {
          "class": "devicon-mongodb-plain",
          "name": "Mongodb"
        },
        {
          "class": "devicon-apachekafka-original",
          "name": "Kafka"
        },
        {
          "uri": "stripe-s-svgrepo-com.svg",
          "name": "Stripe",
          "type": "svg"
        },
        {
          "class": "devicon-amazonwebservices-plain-wordmark",
          "name": "Amazon web services"
        }
      ]
    }, 
    {
      "title": "Klapper",
      "startDate": "2022",
      "description": "Klapper is a social commerce platform that promotes local businesses and brands through engaged consumer communities and local micro-influencers. It offers geolocated deals, a personalized content feed, and a specialized e-commerce community for micro-influencers. Klapper helps users discover and support nearby businesses while enjoying sustainable shopping experiences.",
      "role": "As part of the Klapper team, I played a critical role in saving the project when it was on the brink of collapse due to major bugs. I joined during a crisis state and worked mainly on the backend, using my expertise to guide the front-end team and solve issues related to the React Native app. Thanks to the efforts of the new team, including myself, we were able to save the app and the project, ensuring the satisfaction of our client.",
      "images": [
        "images/portfolio/klapper/p0.jpg",
        "images/portfolio/klapper/p1.jpg"
      ],
      "url": "https://klapper.fr/",
      "technologies": [
        {
          "class": "devicon-react-original",
          "name": "React Native"
        },
        {
          "class": "devicon-nodejs-plain",
          "name": "NodeJS"
        },
        {
          "class": "devicon-express-original",
          "name": "ExpressJS"
        },
        {
          "uri": "nestjs-svgrepo-com.svg",
          "name": "NestJS",
          "type": "svg"
        },
        {
          "class": "devicon-mongodb-plain",
          "name": "Mongodb"
        },
        {
          "class": "devicon-redis-plain",
          "name": "Redis"
        },
        {
          "uri": "algolia-svgrepo-com.svg",
          "name": "Algolia",
          "type": "svg"
        },
        {
          "class": "devicon-amazonwebservices-plain-wordmark",
          "name": "Amazon web services"
        }
      ]
    },
    {
      "title": "LXConnect",
      "startDate": "2023",
      "description": "LXConnect is a centralized platform for managing electronic devices, developed for LACROIX's IoT division. The platform provides comprehensive device management capabilities, enabling organizations to monitor, control, and maintain their electronic devices efficiently. It offers real-time monitoring, device configuration, and seamless integration with various IoT ecosystems.",
      "role": "I contributed to the development of microservices (APIs) for LXConnect as a full-stack engineer. I conducted in-depth analysis of functional and technical requirements in collaboration with business teams. I designed and developed microservices using Java 17 and Spring Boot 3, implementing electronic device management features. I created and executed unit tests using JUnit, Mockito, and AssertJ, following Test-Driven Development (TDD) best practices. I managed containerized deployments with Kubernetes and orchestrated services efficiently. I implemented CI/CD pipelines using GitLab CI.",
      "images": [
        "images/portfolio/lacroix/logo-433x107.webp"
      ],
      "url": "https://www.lacroix-group.com/",
      "technologies": [
        {
          "class": "devicon-java-plain",
          "name": "Java 17"
        },
        {
          "class": "devicon-spring-plain",
          "name": "Spring Boot 3"
        },
        {
          "class": "devicon-postgresql-plain",
          "name": "PostgreSQL"
        },
        {
          "class": "devicon-docker-plain",
          "name": "Docker"
        },
        {
          "class": "devicon-kubernetes-plain",
          "name": "Kubernetes"
        },
        {
          "class": "devicon-redis-plain",
          "name": "Redis"
        },
        {
          "class": "devicon-apachekafka-original",
          "name": "Kafka"
        },
        {
          "class": "devicon-graphql-plain",
          "name": "GraphQL"
        }
      ]
    },
    {
      "title": "Consentia Health Platform",
      "startDate": "2024",
      "description": "A comprehensive Spring/Angular-based application designed to automate tasks in the healthcare sector. The platform streamlines healthcare operations, improves efficiency, and enhances patient care through automated workflows and intelligent task management. It provides healthcare professionals with tools to manage their daily operations more effectively.",
      "role": "As Lead Full-Stack Developer, I led a team of 5 developers on this healthcare automation project. I conducted functional analysis and facilitated planning meetings with stakeholders to gather user requirements. I contributed to writing functional specifications and prepared a detailed technical specification document. I designed the application and defined a monolithic technical architecture aligned with project objectives. I developed the application using Java (Spring Boot 3, Spring Data, Spring Security) and Angular 19 with Tailwind CSS. I implemented user access control and security mechanisms using JWT and Spring Security. I wrote unit tests to ensure code quality and reliability. I set up CI/CD pipelines for the QA environment using GitHub Actions and Docker.",
      "images": [
        "images/portfolio/consentia/logo.svg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-java-plain",
          "name": "Java"
        },
        {
          "class": "devicon-spring-plain",
          "name": "Spring Boot 3"
        },
        {
          "class": "devicon-angularjs-plain",
          "name": "Angular 19"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-postgresql-plain",
          "name": "PostgreSQL"
        },
        {
          "class": "devicon-docker-plain",
          "name": "Docker"
        },
        {
          "class": "devicon-git-plain",
          "name": "Git"
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "Consentia",
      "title": "Lead full-stack",
      "years": "12.2024 - present",
      "mainTech": [
        "Spring Boot 3",
        "Angular 19"
      ],
      "icon": "fa-java",
      "technologies": [
        "Java",
        "Spring Boot 3",
        "Spring Data",
        "Spring Security",
        "JWT",
        "Angular 19",
        "Tailwind CSS",
        "PostgreSQL",
        "Hibernate",
        "REST API",
        "Postman",
        "Jira",
        "Confluence",
        "Git",
        "GitHub",
        "GitHub Actions",
        "Docker",
        "IntelliJ IDEA",
        "VS Code",
        "Cursor"
      ]
    },
    {
      "company": "LACROIX",
      "title": "Full-stack engineer",
      "years": "10.2023 - 10.2024",
      "mainTech": [
        "Java 17",
        "Spring Boot 3"
      ],
      "icon": "fa-java",
      "technologies": [
        "Java 17",
        "Spring Boot 2/3",
        "REST API",
        "GraphQL",
        "PostgreSQL (JSONB)",
        "Docker",
        "Kubernetes",
        "Warp 10",
        "Redis",
        "Kafka",
        "API Curio",
        "Swagger",
        "Jira",
        "Confluence",
        "SonarQube",
        "IntelliJ IDEA",
        "Insomnia"
      ]
    },
    {
      "company": "Keeneye solutions",
      "title": "Senior software engineer",
      "years": "01.2021 - 08.2023",
      "mainTech": [
        "NodeJS"
      ],
      "icon" : "fa-node-js",
      "technologies": [
        "REST API",
        "ExpressJS",
        "NestJS",
        "Kafka",
        "Redis",
        "AWS",
        "Mongodb",
        "Postman",
        "Jest",
        "Supertest",
        "Chai",
        "Mocha",
        "Stripe",
        "jwt"
      ]
    },
    {
      "company": "Tech-instinct",
      "title": "Software engineer",
      "years": "09.2018 - 09.2020",
      "icon" : "fa-angular",
      "mainTech": [
        "Angular 6/7/8/9"
      ],
      "technologies": [
        "REST API",
        "RxJS",
        "JavaScript",
        "TypeScript",
        "Bootstrap",
        "MDBootstrap",
        "Angular Material",
        "Stamp",
        "Java",
        "Spring",
        "JHipster",
        "Swagger",
        "Stripe",
        "jwt"
      ]
    },
    {
      "company": "Delti",
      "title": "Full-stack engineer",
      "years": "09.2017 - 09.2018",
      "icon": "fa-angular",
      "mainTech": [
        "Angular 4-5",
        "Spring Boot"
      ],
      "technologies": [
        "Angular 4-5",
        "TypeScript",
        "RxJS",
        "SCSS",
        "Java",
        "Spring Boot",
        "Flutter",
        "Dart",
        "GetX",
        "Node.js",
        "Google Cloud",
        "Firestore",
        "Cloud Functions",
        "Cloud Storage",
        "Git",
        "Docker",
        "GitHub Actions",
        "Algolia",
        "JUnit",
        "Mockito",
        "AssertJ"
      ]
    }
  ]
}